In [1]:
# the "#"" in a code cell indicates a comment, test after the # will not be executed
import math

# Now that we have imported math we can access some of the elements identified in the package, 
# For example math contains a definition for pi, we can access that by executing the pi method 
# of the library math
math.pi

3.141592653589793

In [2]:
from math import pi,cos,sin

print(pi)
print(cos(3))

3.141592653589793
-0.9899924966004454

In [3]:
import math as m
print(m.pi)
print(m.cos(3))

3.141592653589793
-0.9899924966004454

In [4]:
import pandas as pd

In [5]:
values=[7,8,9,10,11]
weird=["Some text","Some more Text",2,3]

# Here the constructor is passed a numeric list
Simplest=pd.Series([2,3,4,5,6])
Simplest

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [6]:
# In this case the constructor is passed a variable that contains a list
simple2=pd.Series(values)
simple2

0     7
1     8
2     9
3    10
4    11
dtype: int64

In [7]:
# Here the constructor is passed a variable containing a list that is a mix of 
# alphanumerics and numerical values
simple3=pd.Series(weird)
simple3

0         Some text
1    Some more Text
2                 2
3                 3
dtype: object

In [8]:
# In this example the constructor is given both the values 
# and specific values for the index
Simplest=pd.Series([2,3,4,5,6],index=[1966,1967,1996,1999,2000])
Simplest

1966    2
1967    3
1996    4
1999    5
2000    6
dtype: int64

In [9]:
simple2=pd.Series(values,index=[1966,1967,1996,1999,2000])
simple2

1966     7
1967     8
1996     9
1999    10
2000    11
dtype: int64

In [10]:
mydict2={1966:2,1967:3,1968:4,1969:5,2000:6}
simple2=pd.Series(mydict2)
simple2

1966    2
1967    3
1968    4
1969    5
2000    6
dtype: int64

In [11]:

df = pd.DataFrame({'B': [1,1,1,1],'C':[1,2,3,6],'E':[4,4,4,4]},index=[2018,2019,2020,2021])
df

      B  C  E
2018  1  1  4
2019  1  2  4
2020  1  3  4
2021  1  6  4

In [12]:
df["NEW"]=[10,12,10,13]
df

      B  C  E  NEW
2018  1  1  4   10
2019  1  2  4   12
2020  1  3  4   10
2021  1  6  4   13

In [13]:
df["NEW"]=[11,12,10,14]

df

      B  C  E  NEW
2018  1  1  4   11
2019  1  2  4   12
2020  1  3  4   10
2021  1  6  4   14

In [14]:
# replace all of the rows of column B with the same value
df['B']=17
df

       B  C  E  NEW
2018  17  1  4   11
2019  17  2  4   12
2020  17  3  4   10
2021  17  6  4   14

In [15]:
df.columns

Index(['B', 'C', 'E', 'NEW'], dtype='object')

In [16]:
df.columns.size

4

In [17]:
df.eval('''X = B*C
           THE_ANSWER = 42''')

       B  C  E  NEW    X  THE_ANSWER
2018  17  1  4   11   17          42
2019  17  2  4   12   34          42
2020  17  3  4   10   51          42
2021  17  6  4   14  102          42

In [18]:
df

       B  C  E  NEW
2018  17  1  4   11
2019  17  2  4   12
2020  17  3  4   10
2021  17  6  4   14

In [19]:
df=df.eval('''X = B*C
           THE_ANSWER = 42''')
df

       B  C  E  NEW    X  THE_ANSWER
2018  17  1  4   11   17          42
2019  17  2  4   12   34          42
2020  17  3  4   10   51          42
2021  17  6  4   14  102          42

In [20]:
df.loc[2019,'C']

2

In [21]:
df.loc[:,'C']

2018    1
2019    2
2020    3
2021    6
Name: C, dtype: int64

In [22]:
df.loc[2019,:]

B             17
C              2
E              4
NEW           12
X             34
THE_ANSWER    42
Name: 2019, dtype: int64

In [23]:
df.loc[[2018,2021],['B','C']]

       B  C
2018  17  1
2021  17  6

In [24]:

df.loc[2018:2020,['B','C']]

       B  C
2018  17  1
2019  17  2
2020  17  3

In [25]:
df.loc[2019:2020,'C'] = 17
df

       B   C  E  NEW    X  THE_ANSWER
2018  17   1  4   11   17          42
2019  17  17  4   12   34          42
2020  17  17  4   10   51          42
2021  17   6  4   14  102          42